{"method":"Agglomerative Clustering","desc":"<span class='help-method'>Agglomerative Clustering</span>Recursively merges the pair of clusters that minimally increases a given linkage distance. Read more in the scikit-learn user guide. ","url":"http://scikit-learn.org/stable/modules/generated/sklearn.cluster.AgglomerativeClustering.html#sklearn.cluster.AgglomerativeClustering","params":[{"name":"n clusters","type":"int, default=2","desc":"The number of clusters to find."},{"name":"affinity","type":"string or callable, default","desc":"Metric used to compute the linkage. Can be “euclidean”, “l1”, “l2”, “manhattan”, “cosine”, or ‘precomputed’. If linkage is “ward”, only “euclidean” is accepted."},{"name":"memory","type":"None, str or object with the joblib.Memory interface, optional","desc":"Used to cache the output of the computation of the tree. By default, no caching is done. If a string is given, it is the path to the caching directory."},{"name":"connectivity","type":"array-like or callable, optional","desc":"Connectivity matrix. Defines for each sample the neighboring samples following a given structure of the data. This can be a connectivity matrix itself or a callable that transforms the data into a connectivity matrix, such as derived from kneighbors_graph. Default is None, i.e, the hierarchical clustering algorithm is unstructured."},{"name":"compute full tree","type":"bool or ‘auto’ (optional)","desc":"Stop early the construction of the tree at n_clusters. This is useful to decrease computation time if the number of clusters is not small compared to the number of samples. This option is useful only when specifying a connectivity matrix. Note also that when varying the number of clusters and using caching, it may be advantageous to compute the full tree."},{"name":"linkage","type":"{“ward”, “complete”, “average”}, optional, default","desc":"Which linkage criterion to use. The linkage criterion determines which distance to use between sets of observation. The algorithm will merge the pairs of cluster that minimize this criterion.  ward minimizes the variance of the clusters being merged. average uses the average of the distances of each observation of the two sets. complete or maximum linkage uses the maximum distances between all observations of the two sets."},{"name":"pooling func","type":"callable, default=np.mean","desc":"This combines the values of agglomerated features into a single value, and should accept an array of shape [M, N] and the keyword argument axis=1, and reduce it to an array of size [M]."}],"attrs":[{"name":"labels","type":"array [n_samples]","desc":"cluster labels for each point"},{"name":"n leaves","type":"int","desc":"Number of leaves in the hierarchical tree."},{"name":"n components","type":"int","desc":"The estimated number of connected components in the graph."},{"name":"children","type":"array-like, shape (n_nodes-1, 2)","desc":"The children of each non-leaf node. Values less than n_samples correspond to leaves of the tree which are the original samples. A node i greater than or equal to n_samples is a non-leaf node and has children children_[i - n_samples]. Alternatively at the i-th iteration, children[i][0] and children[i][1] are merged to form node n_samples + i"}]}