{"method":"Birch","desc":"<span class='help-method'>Implements the Birch clustering algorithm.</span>It is a memory-efficient, online-learning algorithm provided as an alternative to MiniBatchKMeans. It constructs a tree data structure with the cluster centroids being read off the leaf. These can be either the final cluster centroids or can be provided as input to another clustering algorithm such as AgglomerativeClustering. Read more in the scikit-learn user guide. ","url":"http://scikit-learn.org/stable/modules/generated/sklearn.cluster.Birch.html#sklearn.cluster.Birch","params":[{"name":"threshold","type":"float, default 0.5","desc":"The radius of the subcluster obtained by merging a new sample and the closest subcluster should be lesser than the threshold. Otherwise a new subcluster is started. Setting this value to be very low promotes splitting and vice-versa."},{"name":"branching factor","type":"int, default 50","desc":"Maximum number of CF subclusters in each node. If a new samples enters such that the number of subclusters exceed the branching_factor then that node is split into two nodes with the subclusters redistributed in each. The parent subcluster of that node is removed and two new subclusters are added as parents of the 2 split nodes."},{"name":"n clusters","type":"int, instance of sklearn.cluster model, default 3","desc":"Number of clusters after the final clustering step, which treats the subclusters from the leaves as new samples.  None : the final clustering step is not performed and the subclusters are returned as they are. sklearn.cluster Estimator : If a model is provided, the model is fit treating the subclusters as new samples and the initial data is mapped to the label of the closest subcluster. int : the model fit is AgglomerativeClustering with n_clusters set to be equal to the int."},{"name":"compute labels","type":"bool, default True","desc":"Whether or not to compute labels for each fit."},{"name":"copy","type":"bool, default True","desc":"Whether or not to make a copy of the given data. If set to False, the initial data will be overwritten."}],"attrs":[{"name":"root","type":"_CFNode","desc":"Root of the CFTree."},{"name":"dummy leaf","type":"_CFNode","desc":"Start pointer to all the leaves."},{"name":"subcluster centers","type":"ndarray,","desc":"Centroids of all subclusters read directly from the leaves."},{"name":"subcluster labels","type":"ndarray,","desc":"Labels assigned to the centroids of the subclusters after they are clustered globally."},{"name":"labels","type":"ndarray, shape (n_samples,)","desc":"Array of labels assigned to the input data. if partial_fit is used instead of fit, they are assigned to the last batch of data."}]}