{
    "method": "Chromosome",
    "summary": "Explore genes and genetic mutations using chromosome view. Zoom to see associated genes, or delve into edges, to link patient populations",
    "desc": "<span class='help-method'>Chromosome</span> Ensemble Genes 91 – Human Genes GRCH38 and GRCH19",
    "url": "",
    "params": [
        {
            "name": "n components",
            "type": "int or None",
            "desc": "Coming Soon"
        }
        
    ],
    "attrs": [
        {
            "name": "components",
            "type": "array, [n_components, n_features]",
            "desc": "Coming Soon"
        }
    ],
    "citations": [
        {
            "name": "Ensembl 2018",
            "desc": "Daniel R. Zerbino, Premanand Achuthan, Wasiu Akanni, M. Ridwan Amode, Daniel Barrell, Jyothish Bhai, Konstantinos Billis, Carla Cummins, Astrid Gall, Carlos García Giro´n, Laurent Gil, Leo Gordon, Leanne Haggerty, Erin Haskell, Thibaut Hourlier, Osagie G. Izuogu, Sophie H. Janacek, Thomas Juettemann, Jimmy Kiang To, Matthew R. Laird, Ilias Lavidas, Zhicheng Liu, Jane E. Loveland, Thomas Maurel, William McLaren, Benjamin Moore, Jonathan Mudge, Daniel N. Murphy, Victoria Newman, Michael Nuhn, Denye Ogeh, Chuang Kee Ong, Anne Parker, Mateus Patricio, Harpreet Singh Riat, Helen Schuilenburg, Dan Sheppard, Helen Sparrow, Kieron Taylor, Anja Thormann, Alessandro Vullo, Brandon Walts, Amonida Zadissa, Adam Frankish, Sarah E. Hunt, Myrto Kostadima, Nicholas Langridge, Fergal J. Martin, Matthieu Muffato, Emily Perry, Magali Ruffier, Dan M. Staines, Stephen J. Trevanion, Bronwen L. Aken, Fiona Cunningham, Andrew Yates, Paul FlicekEnsembl 2018. PubMed PMID: 29155950.",
            "url": "https://academic.oup.com/nar/article/46/D1/D754/4634002"
        },
        {
            "name": "Scientific Publications, Citing Ensembl Data",
            "desc": "Since release 25, all Ensembl releases have been archived as fully functional sites for about three years. This makes it possible to accurately cite data being referred to in a paper, even though the main Ensembl site is being continuously updated (currently release 91 - December 2017). ",
            "url": "http://uswest.ensembl.org/info/about/publications.html#current_ensembl"
        }
    ]
}