{"method":"K Means","desc":"K-Means clustering<br />Read more in the User Guide.<br />","url":"http://scikit-learn.org/stable/modules/generated/sklearn.cluster.KMeans.html#sklearn.cluster.KMeans","params":[{"name":"n_clusters","type":"int, optional, default","desc":"The number of clusters to form as well as the number of centroids to generate."},{"name":"init","type":"{‘k-means++’, ‘random’ or an ndarray}","desc":"Method for initialization, defaults to ‘k-means++’: ‘k-means++’ : selects initial cluster centers for k-mean clustering in a smart way to speed up convergence. See section Notes in k_init for more details. ‘random’: choose k observations (rows) at random from data for the initial centroids. If an ndarray is passed, it should be of shape (n_clusters, n_features) and gives the initial centers."},{"name":"n_init","type":"int, default","desc":"Number of time the k-means algorithm will be run with different centroid seeds. The final results will be the best output of n_init consecutive runs in terms of inertia."},{"name":"max_iter","type":"int, default","desc":"Maximum number of iterations of the k-means algorithm for a single run."},{"name":"tol","type":"float, default","desc":"Relative tolerance with regards to inertia to declare convergence"},{"name":"precompute_distances","type":"{‘auto’, True, False}","desc":"Precompute distances (faster but takes more memory). ‘auto’ : do not precompute distances if n_samples * n_clusters > 12 million. This corresponds to about 100MB overhead per job using double precision. True : always precompute distances False : never precompute distances"},{"name":"verbose","type":"int, default 0","desc":"Verbosity mode."},{"name":"random_state","type":"int, RandomState instance or None, optional, default","desc":"If int, random_state is the seed used by the random number generator; If RandomState instance, random_state is the random number generator; If None, the random number generator is the RandomState instance used by np.random."},{"name":"copy_x","type":"boolean, default True","desc":"When pre-computing distances it is more numerically accurate to center the data first.  If copy_x is True, then the original data is not modified.  If False, the original data is modified, and put back before the function returns, but small numerical differences may be introduced by subtracting and then adding the data mean."},{"name":"n_jobs","type":"int","desc":"The number of jobs to use for the computation. This works by computing each of the n_init runs in parallel. If -1 all CPUs are used. If 1 is given, no parallel computing code is used at all, which is useful for debugging. For n_jobs below -1, (n_cpus + 1 + n_jobs) are used. Thus for n_jobs = -2, all CPUs but one are used."},{"name":"algorithm","type":"“auto”, “full” or “elkan”, default=”auto”","desc":"K-means algorithm to use. The classical EM-style algorithm is “full”. The “elkan” variation is more efficient by using the triangle inequality, but currently doesn’t support sparse data. “auto” chooses “elkan” for dense data and “full” for sparse data."}],"attrs":[{"name":"cluster_centers_","type":"array, [n_clusters, n_features]","desc":"Coordinates of cluster centers"},{"name":"labels_","type":"","desc":"Labels of each point"},{"name":"inertia_","type":"float","desc":"Sum of squared distances of samples to their closest cluster center."}]}