{
    "method": "MDS",
    "summary": "Multidimensional scaling is a means of visualizing the level of similarity of individual cases of a dataset.  It refers to a set of related ordination techniques used in information visualization, in particular to display the information contained in a distance matrix",
    "desc": "<span class='help-method'>Multidimensional scaling</span>Read more in the scikit-learn user guide. ",
    "url": "http://scikit-learn.org/stable/modules/generated/sklearn.manifold.MDS.html#sklearn.manifold.MDS",
    "params": [
        {
            "name": "n components",
            "type": "int, optional, default",
            "desc": "Number of dimensions in which to immerse the dissimilarities."
        },
        {
            "name": "metric",
            "type": "boolean, optional, default",
            "desc": "If True, perform metric MDS; otherwise, perform nonmetric MDS."
        },
        {
            "name": "n init",
            "type": "int, optional, default",
            "desc": "Number of times the SMACOF algorithm will be run with different initializations. The final results will be the best output of the runs, determined by the run with the smallest final stress."
        },
        {
            "name": "max iter",
            "type": "int, optional, default",
            "desc": "Maximum number of iterations of the SMACOF algorithm for a single run."
        },
        {
            "name": "verbose",
            "type": "int, optional, default",
            "desc": "Level of verbosity."
        },
        {
            "name": "eps",
            "type": "float, optional, default",
            "desc": "Relative tolerance with respect to stress at which to declare convergence."
        },
        {
            "name": "n jobs",
            "type": "int, optional, default",
            "desc": "The number of jobs to use for the computation. If multiple initializations are used (n_init), each run of the algorithm is computed in parallel. If -1 all CPUs are used. If 1 is given, no parallel computing code is used at all, which is useful for debugging. For n_jobs below -1, (n_cpus + 1 + n_jobs) are used. Thus for n_jobs = -2, all CPUs but one are used."
        },
        {
            "name": "random state",
            "type": "int, RandomState instance or None, optional, default",
            "desc": "The generator used to initialize the centers.  If int, random_state is the seed used by the random number generator; If RandomState instance, random_state is the random number generator; If None, the random number generator is the RandomState instance used by np.random."
        },
        {
            "name": "dissimilarity",
            "type": "‘euclidean’ | ‘precomputed’, optional, default",
            "desc": "Dissimilarity measure to use:   ‘euclidean’: Pairwise Euclidean distances between points in the dataset.    ‘precomputed’: Pre-computed dissimilarities are passed directly to fit and fit_transform."
        }
    ],
    "attrs": [
        {
            "name": "embedding",
            "type": "array-like, shape (n_components, n_samples)",
            "desc": "Stores the position of the dataset in the embedding space."
        },
        {
            "name": "stress",
            "type": "float",
            "desc": "The final value of the stress (sum of squared distance of the disparities and the distances for all constrained points)."
        }
    ],
    "citations": [
        {
            "name":"Modern Multidimensional Scaling - Theory and Applications",
            "desc": "Modern Multidimensional Scaling - Theory and Applications” Borg, I.; Groenen P. Springer Series in Statistics (1997)",
            "url": "http://www.springer.com/us/book/9781475727111"
        },
        {
            "name":"Nonmetric multidimensional scaling: a numerical method",
            "desc": "Nonmetric multidimensional scaling: a numerical method” Kruskal, J. Psychometrika, 29 (1964)",
            "url": "https://link.springer.com/article/10.1007/BF02289694"
        },
        {
            "name":"Multidimensional scaling by optimizing goodness of fit to a nonmetric hypothesis",
            "desc": "Multidimensional scaling by optimizing goodness of fit to a nonmetric hypothesis” Kruskal, J. Psychometrika, 29, (1964)",
            "url": "https://link.springer.com/article/10.1007/BF02289565"
        },
        {
            "name": "Scikit-learn: Machine Learning in Python",
            "desc": "Scikit-learn: Machine Learning in Python, Pedregosa et al., JMLR 12, pp. 2825-2830, 2011.",
            "url": "http://www.jmlr.org/papers/volume12/pedregosa11a/pedregosa11a.pdf"
        },
        {
            "name": "API design for machine learning software: experiences from the scikit-learn project",
            "desc": "API design for machine learning software: experiences from the scikit-learn project, Buitinck et al., 2013.",
            "url": "http://www.di.ens.fr/sierra/pdfs/icml09.pdf"
        }
    ]
}