{"method":"Mean Shift","desc":"<span class='help-method'>Mean shift clustering using a flat kernel.</span>Mean shift clustering aims to discover “blobs” in a smooth density of samples. It is a centroid-based algorithm, which works by updating candidates for centroids to be the mean of the points within a given region. These candidates are then filtered in a post-processing stage to eliminate near-duplicates to form the final set of centroids. Seeding is performed using a binning technique for scalability. Read more in the scikit-learn user guide. ","url":"http://scikit-learn.org/stable/modules/generated/sklearn.cluster.MeanShift.html#sklearn.cluster.MeanShift","params":[{"name":"bandwidth","type":"float, optional","desc":"Bandwidth used in the RBF kernel. If not given, the bandwidth is estimated using sklearn.cluster.estimate_bandwidth; see the documentation for that function for hints on scalability (see also the Notes, below)."},{"name":"seeds","type":"array, shape=[n_samples, n_features], optional","desc":"Seeds used to initialize kernels. If not set, the seeds are calculated by clustering.get_bin_seeds with bandwidth as the grid size and default values for other parameters."},{"name":"bin seeding","type":"boolean, optional","desc":"If true, initial kernel locations are not locations of all points, but rather the location of the discretized version of points, where points are binned onto a grid whose coarseness corresponds to the bandwidth. Setting this option to True will speed up the algorithm because fewer seeds will be initialized. default value: False Ignored if seeds argument is not None."},{"name":"min bin freq","type":"int, optional","desc":"To speed up the algorithm, accept only those bins with at least min_bin_freq points as seeds. If not defined, set to 1."},{"name":"cluster all","type":"boolean, default True","desc":"If true, then all points are clustered, even those orphans that are not within any kernel. Orphans are assigned to the nearest kernel. If false, then orphans are given cluster label -1."},{"name":"n jobs","type":"int","desc":"The number of jobs to use for the computation. This works by computing each of the n_init runs in parallel. If -1 all CPUs are used. If 1 is given, no parallel computing code is used at all, which is useful for debugging. For n_jobs below -1, (n_cpus + 1 + n_jobs) are used. Thus for n_jobs = -2, all CPUs but one are used."}],"attrs":[{"name":"cluster centers","type":"array, [n_clusters, n_features]","desc":"Coordinates of cluster centers."},{"name":"labels","type":"","desc":"Labels of each point."}]}