{"method":"Smacof","desc":"Computes multidimensional scaling using the SMACOF algorithm.<br />The SMACOF (Scaling by MAjorizing a COmplicated Function) algorithm is a<br />multidimensional scaling algorithm which minimizes an objective function<br />(the stress) using a majorization technique. Stress majorization, also<br />known as the Guttman Transform, guarantees a monotone convergence of<br />stress, and is more powerful than traditional techniques such as gradient<br />descent.<br />The SMACOF algorithm for metric MDS can summarized by the following steps:<br />Set an initial start configuration, randomly or not.<br />Compute the stress<br />Compute the Guttman Transform<br />Iterate 2 and 3 until convergence.<br />The nonmetric algorithm adds a monotonic regression step before computing<br />the stress.<br />","url":"http://scikit-learn.org/stable/modules/generated/sklearn.manifold.smacof.html#sklearn.manifold.smacof","params":[{"name":"dissimilarities","type":"ndarray, shape (n_samples, n_samples)","desc":"Pairwise dissimilarities between the points. Must be symmetric."},{"name":"metric","type":"boolean, optional, default","desc":"Compute metric or nonmetric SMACOF algorithm."},{"name":"n_components","type":"int, optional, default","desc":"Number of dimensions in which to immerse the dissimilarities. If an init array is provided, this option is overridden and the shape of init is used to determine the dimensionality of the embedding space."},{"name":"init","type":"ndarray, shape (n_samples, n_components), optional, default","desc":"Starting configuration of the embedding to initialize the algorithm. By default, the algorithm is initialized with a randomly chosen array."},{"name":"n_init","type":"int, optional, default","desc":"Number of times the SMACOF algorithm will be run with different initializations. The final results will be the best output of the runs, determined by the run with the smallest final stress. If init is provided, this option is overridden and a single run is performed."},{"name":"n_jobs","type":"int, optional, default","desc":"The number of jobs to use for the computation. If multiple initializations are used (n_init), each run of the algorithm is computed in parallel. If -1 all CPUs are used. If 1 is given, no parallel computing code is used at all, which is useful for debugging. For n_jobs below -1, (n_cpus + 1 + n_jobs) are used. Thus for n_jobs = -2, all CPUs but one are used."},{"name":"max_iter","type":"int, optional, default","desc":"Maximum number of iterations of the SMACOF algorithm for a single run."},{"name":"verbose","type":"int, optional, default","desc":"Level of verbosity."},{"name":"eps","type":"float, optional, default","desc":"Relative tolerance with respect to stress at which to declare convergence."},{"name":"random_state","type":"int, RandomState instance or None, optional, default","desc":"The generator used to initialize the centers.  If int, random_state is the seed used by the random number generator; If RandomState instance, random_state is the random number generator; If None, the random number generator is the RandomState instance used by np.random."},{"name":"return_n_iter","type":"bool, optional, default","desc":"Whether or not to return the number of iterations."}],"attrs":[{"name":"X","type":"ndarray, shape (n_samples, n_components)","desc":"Coordinates of the points in a n_components-space."},{"name":"stress","type":"float","desc":"The final value of the stress (sum of squared distance of the disparities and the distances for all constrained points)."},{"name":"n_iter","type":"int","desc":"The number of iterations corresponding to the best stress. Returned only if return_n_iter is set to True."}]}